jch12138/nrf52840_rtt/applications/ble_app_hrs.c
}

MSH_CMD_EXPORT(hrs_tf_on, transport realtime);
int hrs_tf_off(void)
{
    rt_timer_delete(update);
    return RT_EOK;
}
MSH_CMD_EXPORT(hrs_tf_off, stop transport);

int save_sample(char *filename)
{
    char *fname = '1616161616.txt';
    fname = filename;
    fd=  open(&fname, O_WRONLY | O_CREAT);
    if(fd>0)
    {
        rt_kprintf('file creat and open successfully\r\n');
    }
    while(1)
    {
        result1 = rt_adc_read(adc_dev, 5);
        result2 = rt_adc_read(adc_dev, 6);
        result3 = rt_adc_read(adc_dev, 7);


    }

}
MSH_CMD_EXPORT(save_sample, adcvalue save to file);

int stop_save(void)
{

}
MSH_CMD_EXPORT(stop_save, stop_save save adcvalue);

// int ble_app_hrs(void)
// {
//     rt_ringbuffer_init(&ringbuffer_handler, ringbuffer, sizeof(ringbuffer));
//     rt_ringbuffer_init(&ringbuffer_putc_handler, ringbuffer_putc, sizeof(ringbuffer_putc));
//     serial = rt_device_find(UART_NAME);
//     if (!serial)
//     {
//         rt_kprintf("find %s failed!\n", UART_NAME);
//         return -RT_ERROR;
//     }
//     static rt_thread_t tid1 = RT_NULL;
//     tid1 = rt_thread_create("softdevice",
//                         ble_app_softdevice, RT_NULL,
//                         4096,
//                         22, 5);
//     if (tid1 != RT_NULL)
//         rt_thread_startup(tid1);
//     rt_timer_t update = rt_timer_create("update", timeout, RT_NULL, rt_tick_from_millisecond(20), RT_TIMER_FLAG_PERIODIC | RT_TIMER_FLAG_SOFT_TIMER);
//     //启动定时器，20ms广播一次数据
//     if (update != RT_NULL)
//         rt_timer_start(update);
//     return RT_EOK;
//     // tid1 = rt_thread_create("serial_task",
//     //                     uart_task, RT_NULL,
//     //                     1024,
//     //                     22, 5);
//     // if (tid1 != RT_NULL)
//     // {
//     //     rt_thread_startup(tid1);
//     // }
//     //
// }
// MSH_CMD_EXPORT(ble_app_hrs, ble app heart rate service);
// INIT_APP_EXPORT(ble_app_hrs);